#**Problem Set 2**

###Question 1

Answer:
You start out with a global variable called a that has the value 0. You define a function c(a) that returns a + 2 and accepts a parameter, a. The b() function makes use of this function. The function b() has been defined. It's crucial to understand that by using global an inside b(), you are referring to the global variable a rather than declaring a local variable an inside the method. Calling the c(a) function from the b() function requires supplying the global variable a, which starts at 0. The result of the c(a) function is 2, or 0 + 2. Following the initial invocation of b(), the global variable an is modified to 2. Two more calls to b() are made. It invokes the c(a) function each time, and c(a) always returns a + 2. Thus, an is updated as follows following each call:

A becomes 4 (2 + 2) following the second call to b().
Upon making three calls to b(), a changes to 6 (4 + 2).
You can retrieve the value of the global variable a by executing >>> a. a has a final value of 6.

Thus, the result that appears when you evaluate an in the previous equation will be 6.

###Question 2

In [40]:

def fileLength(filename):
    try:
        infile = open(filename, 'r')
        contents = infile.read()
        infile.close()
        length = len(contents)
        return length
    except FileNotFoundError:
        print(f"File {filename} not found.")

# Test the function
try:
    length = fileLength('midterm.py')
    print(length)
except FileNotFoundError:
    print(f"File midterm.py not found.")

File midterm.py not found.
None

###Question 3

In [39]:
class Marsupial:
    def __init__(self):
        self.pouch = []

    def put_in_pouch(self, item):
        self.pouch.append(item)

    def pouch_contents(self):
        return self.pouch


class Kangaroo(Marsupial):
    def __init__(self, x, y):
        super().__init__()
        self.x = x
        self.y = y

    def jump(self, dx, dy):
        self.x += dx
        self.y += dy

    def __str__(self):
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"


# Test the classes
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
print(m.pouch_contents())

k = Kangaroo(0, 0)
print(k)

k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())

k.jump(1, 0)
k.jump(1, 0)
k.jump(1, 0)
print(k)

['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

###Question 4

In [38]:
def collatz(n):
    print(n)
    while n != 1:
        if n % 2 == 0:
            n = n // 2
        else:
            n = 3 * n + 1
        print(n)

collatz(1)
collatz(10)

1
10
5
16
8
4
2
1

###Question 5

In [37]:

def binary(n):
    if n > 1:
        binary(n // 2)  # Recursive call with integer division
    print(n % 2, end="")  # Print the remainder, end="" to print on the same line

# Test the function
binary(0)
print()  # Print a newline to separate outputs
binary(1)
print()
binary(3)
print()
binary(9)

0
1
11
1001

###Question 6

In [36]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.in_heading = False
        self.heading_level = 0

    def handle_starttag(self, tag, attrs):
        if tag.startswith("h") and tag[1:].isdigit():
            self.in_heading = True
            self.heading_level = int(tag[1])

    def handle_endtag(self, tag):
        if self.in_heading and tag.startswith("h") and tag[1:].isdigit():
            self.in_heading = False

    def handle_data(self, data):
        if self.in_heading:
            indentation = "  " * (self.heading_level - 1)
            print(f"{indentation}{data}")

# Test the HeadingParser
with open("/content/w3c.html", 'r', encoding='utf-8') as infile:
    content = infile.read()

hp = HeadingParser()
hp.feed(content)

W3C Mission
  Principles

###Question 7

In [ ]:
from urllib.request import urlopen
from html.parser import HTMLParser
from urllib.parse import urljoin

class WebDirParser(HTMLParser):
    def __init__(self, depth, indent):
        super().__init()
        self.depth = depth
        self.indent = indent
        self.current_depth = 0

    def handle_starttag(self, tag, attrs):
        if tag == 'a':
            for attr, value in attrs:
                if attr == 'href':
                    new_url = urljoin(current_url, value)
                    if self.current_depth < self.depth:
                        print(" " * self.indent * self.current_depth + new_url)
                        self.visit(new_url, self.current_depth + 1)

def webdir(url, depth, indent):
    print(url)
    parser = WebDirParser(depth, indent)
    parser.visit(url, 1)

# Test the function
webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0)

###Question 8

In [3]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.22)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 10.7 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.8)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [1]:
import pandas as pd
import sqlite3

In [10]:
df = pd.DataFrame({'City': ['Mumbai','Mumbai','Mumbai','Mumbai','London','London','London','London','Cairo','Cairo','Cairo','Cairo'],
                    'Country': ['India','India','India','India','United Kingdom','United Kingdom','United Kingdom','United Kingdom','Egypt','Egypt','Egypt','Egypt'],
                    'Season': ['Winter','Spring','Summer','Fall','Winter','Spring','Summer','Fall','Winter','Spring','Summer','Fall'],
                    'Temperature': [24.8, 28.4, 27.9, 27.6, 4.2, 8.3, 15.7, 10.4,13.6, 20.7, 27.7, 22.2],
                    'Rainfall': [5.9, 16.2, 1549.4, 346.0, 207.7, 169.6, 157.0, 218.5, 16.5, 6.5, 0.1, 4.5]})

print(df)

      City         Country  Season  Temperature  Rainfall
0   Mumbai           India  Winter         24.8       5.9
1   Mumbai           India  Spring         28.4      16.2
2   Mumbai           India  Summer         27.9    1549.4
3   Mumbai           India    Fall         27.6     346.0
4   London  United Kingdom  Winter          4.2     207.7
5   London  United Kingdom  Spring          8.3     169.6
6   London  United Kingdom  Summer         15.7     157.0
7   London  United Kingdom    Fall         10.4     218.5
8    Cairo           Egypt  Winter         13.6      16.5
9    Cairo           Egypt  Spring         20.7       6.5
10   Cairo           Egypt  Summer         27.7       0.1
11   Cairo           Egypt    Fall         22.2       4.5

In [12]:
cnn = sqlite3.connect('jupiter_sql.db')

In [13]:
df.to_sql('CityWeather',cnn)

12

In [14]:
%load_ext sql

In [15]:
%sql sqlite:///jupiter_sql.db

In [17]:
%%sql

SELECT *
FROM CityWeather

 * sqlite:///jupiter_sql.db
Done.

[(0, 'Mumbai', 'India', 'Winter', 24.8, 5.9),
 (1, 'Mumbai', 'India', 'Spring', 28.4, 16.2),
 (2, 'Mumbai', 'India', 'Summer', 27.9, 1549.4),
 (3, 'Mumbai', 'India', 'Fall', 27.6, 346.0),
 (4, 'London', 'United Kingdom', 'Winter', 4.2, 207.7),
 (5, 'London', 'United Kingdom', 'Spring', 8.3, 169.6),
 (6, 'London', 'United Kingdom', 'Summer', 15.7, 157.0),
 (7, 'London', 'United Kingdom', 'Fall', 10.4, 218.5),
 (8, 'Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 (9, 'Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 (10, 'Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 (11, 'Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

A)

In [18]:
%%sql SELECT Temperature FROM CityWeather;

 * sqlite:///jupiter_sql.db
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

B)

In [19]:
%%sql SELECT DISTINCT City FROM CityWeather;

 * sqlite:///jupiter_sql.db
Done.

[('Mumbai',), ('London',), ('Cairo',)]

C)

In [20]:
%%sql SELECT * FROM CityWeather WHERE Country = 'India';

 * sqlite:///jupiter_sql.db
Done.

[(0, 'Mumbai', 'India', 'Winter', 24.8, 5.9),
 (1, 'Mumbai', 'India', 'Spring', 28.4, 16.2),
 (2, 'Mumbai', 'India', 'Summer', 27.9, 1549.4),
 (3, 'Mumbai', 'India', 'Fall', 27.6, 346.0)]

D)

In [21]:
%%sql SELECT * FROM CityWeather WHERE Season = 'Fall';

 * sqlite:///jupiter_sql.db
Done.

[(3, 'Mumbai', 'India', 'Fall', 27.6, 346.0),
 (7, 'London', 'United Kingdom', 'Fall', 10.4, 218.5),
 (11, 'Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

E)

In [22]:
%%sql
SELECT City, Country, Season
FROM CityWeather
GROUP BY City, Country, Season
HAVING AVG(Rainfall) BETWEEN 200 AND 400;

 * sqlite:///jupiter_sql.db
Done.

[('London', 'United Kingdom', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('Mumbai', 'India', 'Fall')]

F)

In [23]:
%%sql
SELECT City, Country
FROM CityWeather
WHERE Season = 'Fall'
GROUP BY City, Country
HAVING AVG(Temperature) > 20
ORDER BY AVG(Temperature) ASC;

 * sqlite:///jupiter_sql.db
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

G)

In [24]:
%%sql
SELECT SUM(Rainfall) AS TotalRainfall
FROM CityWeather
WHERE City = 'Cairo';

 * sqlite:///jupiter_sql.db
Done.

[(27.6,)]

H)

In [25]:
%%sql
SELECT Season, SUM(Rainfall) AS TotalRainfall
FROM CityWeather
GROUP BY Season;

 * sqlite:///jupiter_sql.db
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

###Question 9

In [27]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']

In [29]:
uppercase_words = [word.upper() for word in words]
print(uppercase_words)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [30]:
lowercase_words = [word.lower() for word in words]
print(lowercase_words)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [31]:
lowercase_words = [word.lower() for word in words]
print(lowercase_words)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [32]:
word_info = [[word.upper(), word.lower(), len(word)] for word in words]
print(word_info)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

In [33]:
words_4_or_more_chars = [word for word in words if len(word) >= 4]
print(words_4_or_more_chars)

['quick', 'brown', 'jumps', 'over', 'lazy']